Repository: NikulovE/sftp-explorer
Catalog: Strings/*/Resources.resw
Source language: en_us
Languages: es_mx, id_id, pt_pt, ru_ru, zh_cn, zh_tw

# DragTransferCanceled
source: Drag-and-drop transfer canceled
es_mx: Transferencia de arrastrar y soltar cancelada
id_id: Transfer drag-and-drop dibatalkan
pt_pt: Transferência de arrastar e largar cancelada
ru_ru: Копирование через drag-and-drop отменено
zh_cn: 拖放传输已取消
zh_tw: 拖放傳輸已取消

# DragTransferFailed
source: No files could be downloaded
es_mx: No se pudieron descargar archivos
id_id: Tidak ada file yang dapat diunduh
pt_pt: Nenhum ficheiro pôde ser descarregado
ru_ru: Не удалось скачать ни одного файла
zh_cn: 无法下载任何文件
zh_tw: 無法下載任何文件

# DragTransferFailedWithError
source: Drag-and-drop transfer failed: {0}
es_mx: Error en la transferencia de arrastrar y soltar: {0}
id_id: Transfer seret dan lepas gagal: {0}
pt_pt: Falha na transferência de arrastar e largar: {0}
ru_ru: Ошибка копирования через drag-and-drop: {0}
zh_cn: 拖放传输失败：{0}
zh_tw: 拖放傳輸失敗：{0}

# DragTransferCompleteWithSkipped
source: Transfer prepared; skipped {0} inaccessible item(s)
es_mx: Transferencia preparada; omitido {0} elementos inaccesibles
id_id: Transfer disiapkan; melewatkan {0} item yang tidak dapat diakses
pt_pt: Transferência preparada; ignorou {0} itens inacessíveis
ru_ru: Копирование подготовлено; пропущено недоступных элементов: {0}
zh_cn: 转移已准备好；跳过了 {0} 个无法访问的项目
zh_tw: 轉移已準備好；跳過了 {0} 個無法存取的項目

# DragPermissionErrorDescription
source: This item cannot be downloaded because the connected user does not have read access. Choose how to continue.
es_mx: Este elemento no se puede descargar porque el usuario conectado no tiene acceso de lectura. Elige cómo continuar.
id_id: Item ini tidak dapat diunduh karena pengguna yang terhubung tidak memiliki akses baca. Pilih cara untuk melanjutkan.
pt_pt: Este item não pode ser descarregado porque o utilizador ligado não tem acesso de leitura. Escolha como continuar.
ru_ru: Этот элемент невозможно скачать: у подключённого пользователя нет прав на чтение. Выберите дальнейшее действие.
zh_cn: 无法下载该项目，因为连接的用户没有读取权限。选择如何继续。
zh_tw: 無法下載該項目，因為連接的使用者沒有讀取權限。選擇如何繼續。

# DragTransferErrorTitle
source: Download error
es_mx: Error de descarga
id_id: Kesalahan pengunduhan
pt_pt: Erro de download
ru_ru: Ошибка скачивания
zh_cn: 下载错误
zh_tw: 下載錯誤

# DragTransferErrorDescription
source: This item could not be downloaded. Choose how to continue.
es_mx: Este elemento no se pudo descargar. Elige cómo continuar.
id_id: Item ini tidak dapat diunduh. Pilih cara untuk melanjutkan.
pt_pt: Não foi possível fazer o download deste item. Escolha como continuar.
ru_ru: Не удалось скачать этот элемент. Выберите дальнейшее действие.
zh_cn: 无法下载该项目。选择如何继续。
zh_tw: 無法下載該項目。選擇如何繼續。

# DragOptionSkipItem
source: Skip this item
es_mx: Saltar este artículo
id_id: Lewati item ini
pt_pt: Ignorar este item
ru_ru: Пропустить этот элемент
zh_cn: 跳过此项目
zh_tw: 跳過此項目

# DragOptionSkipAllPermissionErrors
source: Skip all permission errors in this transfer
es_mx: Omitir todos los errores de permiso en esta transferencia
id_id: Lewati semua kesalahan izin dalam transfer ini
pt_pt: Ignore todos os erros de permissões nesta transferência
ru_ru: Пропускать все ошибки прав в этой операции
zh_cn: 跳过本次传输中的所有权限错误
zh_tw: 跳過本次傳輸中的所有權限錯誤

# DragOptionTrySudo
source: Try sudo: grant this user read access using ACL, then retry
es_mx: Probar con sudo: conceder acceso de lectura a este usuario mediante ACL y volver a intentarlo
id_id: Coba sudo: berikan akses baca kepada pengguna ini menggunakan ACL, lalu coba lagi
pt_pt: Tente sudo: conceda a este utilizador acesso de leitura utilizando ACL e tente novamente
ru_ru: Попробовать sudo: выдать пользователю доступ на чтение через ACL и повторить
zh_cn: 尝试 sudo：使用 ACL 授予此用户读取权限，然后重试
zh_tw: 嘗試 sudo：使用 ACL 授予此使用者讀取權限，然後重試

# DragOptionRetry
source: Retry this item
es_mx: Reintentar este elemento
id_id: Coba lagi item ini
pt_pt: Tentar novamente este item
ru_ru: Повторить этот элемент
zh_cn: 重试此项目
zh_tw: 重試此項目

# DragOptionSkipAllSimilarErrors
source: Skip all similar errors in this transfer
es_mx: Omita todos los errores similares en esta transferencia
id_id: Lewati semua kesalahan serupa dalam transfer ini
pt_pt: Ignore todos os erros semelhantes nesta transferência
ru_ru: Пропускать все аналогичные ошибки в этой операции
zh_cn: 跳过本次传输中的所有类似错误
zh_tw: 跳過本次傳輸中的所有類似錯誤

# DragOptionCancelTransfer
source: Cancel the entire transfer
es_mx: Cancelar toda la transferencia
id_id: Batalkan seluruh transfer
pt_pt: Cancelar toda a transferência
ru_ru: Отменить всю операцию
zh_cn: 取消整个转移
zh_tw: 取消整個轉移

# DragSudoFixInProgress
source: Trying to grant read access with sudo: {0}
es_mx: Intentando otorgar acceso de lectura con sudo: {0}
id_id: Mencoba memberikan akses baca dengan sudo: {0}
pt_pt: Tentando conceder acesso de leitura com sudo: {0}
ru_ru: Пробуем выдать доступ на чтение через sudo: {0}
zh_cn: 尝试使用 sudo 授予读取权限：{0}
zh_tw: 嘗試使用 sudo 授予讀取權限：{0}

# DragSudoFixFailed
source: sudo could not grant access: {0}
es_mx: sudo no pudo otorgar acceso: {0}
id_id: sudo tidak dapat memberikan akses: {0}
pt_pt: sudo não conseguiu conceder acesso: {0}
ru_ru: sudo не смог выдать доступ: {0}
zh_cn: sudo 无法授予访问权限：{0}
zh_tw: sudo 無法授予存取權限：{0}

# DragSudoNoConnection
source: SSH connection information is unavailable
es_mx: La información de conexión SSH no está disponible
id_id: Informasi koneksi SSH tidak tersedia
pt_pt: As informações de ligação SSH não estão disponíveis
ru_ru: Недоступны параметры SSH-подключения
zh_cn: SSH 连接信息不可用
zh_tw: SSH 連線資訊不可用

# DragSudoInvalidUsername
source: The SSH username cannot be used safely in an ACL command
es_mx: El nombre de usuario SSH no se puede utilizar de forma segura en un comando ACL
id_id: Nama pengguna SSH tidak dapat digunakan dengan aman dalam perintah ACL
pt_pt: O nome de utilizador SSH não pode ser utilizado com segurança num comando ACL
ru_ru: Имя SSH-пользователя нельзя безопасно использовать в ACL-команде
zh_cn: SSH 用户名无法在 ACL 命令中安全使用
zh_tw: SSH 使用者名稱無法在 ACL 指令中安全使用

# DragSudoExitCode
source: sudo/setfacl exited with code {0}
es_mx: Sudo/setfacl salió con el código {0}
id_id: sudo/setfacl keluar dengan kode {0}
pt_pt: sudo/setfacl saiu com o código {0}
ru_ru: sudo/setfacl завершился с кодом {0}
zh_cn: sudo/setfacl 退出，代码为 {0}
zh_tw: sudo/setfacl 退出，代碼為 {0}

# DragTransferIncompleteTitle
source: Transfer completed with skipped items
es_mx: Transferencia completada con elementos omitidos
id_id: Transfer selesai dengan item yang dilewati
pt_pt: Transferência concluída com itens ignorados
ru_ru: Копирование завершено с пропусками
zh_cn: 传输已完成，但已跳过项目
zh_tw: 傳輸已完成，但已跳過項目

# DragTransferIncompleteMessage
source: {0} item(s) were skipped. Accessible files were copied. {1}
es_mx: Se omitieron {0} elementos. Se copiaron los archivos accesibles. {1}
id_id: {0} item dilewati. File yang dapat diakses telah disalin. {1}
pt_pt: {0} itens foram ignorados. Os ficheiros acessíveis foram copiados. {1}
ru_ru: Пропущено элементов: {0}. Доступные файлы скопированы. {1}
zh_cn: 已跳过 {0} 项。复制了可访问的文件。 {1}
zh_tw: 已跳過 {0} 項。複製了可存取的文件。 {1}

# DragSkippedMoreItems
source: ... and {0} more item(s)
es_mx: ... y {0} artículos más
id_id: ... dan {0} item lainnya
pt_pt: ... e mais {0} artigo(s)
ru_ru: ... и ещё элементов: {0}
zh_cn: ...以及另外 {0} 项
zh_tw: ....以及另外 {0} 項

# DragPreparedDataProvided
source: Prepared folder handed to Windows
es_mx: Carpeta preparada entregada a Windows
id_id: Folder yang sudah disiapkan diserahkan ke Windows
pt_pt: Pasta preparada entregue ao Windows
ru_ru: Подготовленная папка передана Windows
zh_cn: 准备好的文件夹交给Windows
zh_tw: 準備好的資料夾交給Windows

# DragPreparationAlreadyRunning
source: Folder preparation is still in progress. Wait for the ready message.
es_mx: La preparación de la carpeta aún está en progreso. Espere el mensaje listo.
id_id: Persiapan folder masih dalam proses. Tunggu pesan siap.
pt_pt: A preparação da pasta ainda está em curso. Aguarde a mensagem pronta.
ru_ru: Подготовка папки ещё выполняется. Дождитесь сообщения о готовности.
zh_cn: 文件夹仍在准备中。请等待就绪提示。
zh_tw: 資料夾仍在準備中。請等候就緒訊息。

# DragPreparationReady
source: Folder is ready. Drag it to the destination again.
es_mx: La carpeta está lista. Arrástralo al destino nuevamente.
id_id: Foldernya sudah siap. Seret ke tujuan lagi.
pt_pt: A pasta está pronta. Arraste-o para o destino novamente.
ru_ru: Папка готова. Перетащите её в целевую директорию ещё раз.
zh_cn: 文件夹已准备就绪。请再次将其拖到目标位置。
zh_tw: 資料夾已準備就緒。請再次將其拖曳到目標位置。

# DragPreparationReadyWithSkipped
source: Folder is ready with {0} skipped item(s). Drag it to the destination again.
es_mx: La carpeta está lista con {0} elementos omitidos. Arrástralo al destino nuevamente.
id_id: Folder sudah siap dengan {0} item yang dilewati. Seret ke tujuan lagi.
pt_pt: A pasta está pronta com {0} itens ignorados. Arraste-o para o destino novamente.
ru_ru: Папка готова, пропущено элементов: {0}. Перетащите её в целевую директорию ещё раз.
zh_cn: 文件夹已准备就绪，跳过了 {0} 个项目。请再次将其拖到目标位置。
zh_tw: 資料夾已準備就緒，略過了 {0} 個項目。請再次將其拖曳到目標位置。

# DragPreparationReadyTitle
source: Folder is ready to copy
es_mx: La carpeta está lista para copiar
id_id: Folder siap untuk disalin
pt_pt: A pasta está pronta para ser copiada
ru_ru: Папка готова к копированию
zh_cn: 文件夹已准备好复制
zh_tw: 資料夾已準備好複製

# DragPreparationReadyMessage
source: The folder has been downloaded to the temporary cache. Drag the same selection to the destination again; the next drop will start copying immediately.
es_mx: La carpeta se descargó en la caché temporal. Vuelva a arrastrar la misma selección al destino; la copia comenzará de inmediato.
id_id: Folder telah diunduh ke cache sementara. Seret lagi pilihan yang sama ke tujuan; pelepasan berikutnya akan langsung mulai menyalin.
pt_pt: A pasta foi transferida para a cache temporária. Arraste novamente a mesma seleção para o destino; a cópia começará de imediato.
ru_ru: Папка скачана во временный кеш. Перетащите тот же элемент в целевую директорию ещё раз — следующее копирование начнётся сразу.
zh_cn: 文件夹已下载到临时缓存。请再次将同一选区拖到目标位置；下一次拖放会立即开始复制。
zh_tw: 資料夾已下載到暫存快取。請再次將相同選取範圍拖曳到目標位置；下一次拖放會立即開始複製。

# DragPreparationReadyWithSkippedMessage
source: The folder has been downloaded to the temporary cache with {0} skipped item(s). Drag the same selection to the destination again; the next drop will copy all accessible files. {1}
es_mx: La carpeta se descargó en la caché temporal y se omitieron {0} elementos. Vuelva a arrastrar la misma selección al destino; se copiarán todos los archivos accesibles. {1}
id_id: Folder telah diunduh ke cache sementara dan {0} item dilewati. Seret lagi pilihan yang sama ke tujuan; semua file yang dapat diakses akan disalin. {1}
pt_pt: A pasta foi transferida para a cache temporária e foram ignorados {0} itens. Arraste novamente a mesma seleção para o destino; todos os ficheiros acessíveis serão copiados. {1}
ru_ru: Папка скачана во временный кеш с пропуском элементов: {0}. Перетащите тот же элемент в целевую директорию ещё раз — будут скопированы все доступные файлы. {1}
zh_cn: 文件夹已下载到临时缓存，跳过了 {0} 个项目。请再次将同一选区拖到目标位置；下一次拖放会复制所有可访问的文件。 {1}
zh_tw: 資料夾已下載到暫存快取，略過了 {0} 個項目。請再次將相同選取範圍拖曳到目標位置；下一次拖放會複製所有可存取的檔案。 {1}

# DragPreparationFailedTitle
source: Folder preparation failed
es_mx: Error al preparar la carpeta
id_id: Persiapan folder gagal
pt_pt: Falha na preparação da pasta
ru_ru: Не удалось подготовить папку
zh_cn: 文件夹准备失败
zh_tw: 資料夾準備失敗

# DragPreparationFailedMessage
source: No items were prepared. Nothing was sent to the destination.
es_mx: No se prepararon artículos. No se envió nada al destino.
id_id: Tidak ada barang yang disiapkan. Tidak ada yang dikirim ke tujuan.
pt_pt: Nenhum item foi preparado. Nada foi enviado para o destino.
ru_ru: Не удалось подготовить ни одного элемента. В целевую директорию ничего не передано.
zh_cn: 没有准备任何物品。没有任何东西被发送到目的地。
zh_tw: 沒有準備任何物品。沒有任何東西被送到目的地。

# DragPreparationFailedWithErrorMessage
source: The folder could not be prepared. Nothing was sent to the destination. {0}
es_mx: No se pudo preparar la carpeta. No se envió nada al destino. {0}
id_id: Folder tidak dapat disiapkan. Tidak ada yang dikirim ke tujuan. {0}
pt_pt: A pasta não pôde ser preparada. Nada foi enviado para o destino. {0}
ru_ru: Не удалось подготовить папку. В целевую директорию ничего не передано. {0}
zh_cn: 无法准备该文件夹。没有任何东西被发送到目的地。 {0}
zh_tw: 無法準備該資料夾。沒有任何東西被送到目的地。 {0}

# DragLargeFolderPreparingTitle
source: Large folder preparation started
es_mx: Se inició la preparación de carpetas grandes
id_id: Persiapan folder besar dimulai
pt_pt: Preparação de pasta grande iniciada
ru_ru: Началась подготовка большой папки
zh_cn: 大文件夹准备开始
zh_tw: 大文件夾準備開始

# DragLargeFolderPreparingMessage
source: This first gesture prepares the folder locally. Watch the progress below; when the ready message appears, drag the folder to the destination again.
es_mx: Este primer gesto prepara la carpeta localmente. Consulte el progreso a continuación; cuando aparezca el mensaje de preparación completada, vuelva a arrastrar la carpeta al destino.
id_id: Gerakan pertama ini mempersiapkan folder secara lokal. Perhatikan kemajuan di bawah ini; saat pesan siap muncul, seret kembali folder ke tujuan.
pt_pt: Este primeiro gesto prepara a pasta localmente. Acompanhe o progresso abaixo; quando aparecer a mensagem de prontidão, arraste novamente a pasta para o destino.
ru_ru: Первый жест подготавливает папку локально. Следите за прогрессом внизу; после сообщения о готовности перетащите папку в целевую директорию ещё раз.
zh_cn: 第一次拖放会在本地准备文件夹。请留意下方进度；出现就绪提示后，再次将文件夹拖到目标位置。
zh_tw: 第一次拖放會在本機準備資料夾。請留意下方進度；出現就緒訊息後，再次將資料夾拖曳到目標位置。

source: Open SFTP connection
es_mx: Abrir conexión SFTP
id_id: Buka koneksi SFTP
pt_pt: Abra a ligação SFTP
ru_ru: Открыть SFTP-подключение
zh_cn: 打开 SFTP 连接
zh_tw: 開啟 SFTP 連接

source: Open SSH terminal
es_mx: Abrir terminal SSH
id_id: Buka terminal SSH
pt_pt: Abra o terminal SSH
ru_ru: Открыть SSH-терминал
zh_cn: 打开 SSH 终端
zh_tw: 打開 SSH 終端

# UnknownHostKeyTitle
source: Unknown SSH host key
es_mx: Clave de host SSH desconocida
id_id: Kunci host SSH tidak dikenal
pt_pt: Chave de host SSH desconhecida
ru_ru: Неизвестный ключ SSH-сервера
zh_cn: 未知 SSH 主机密钥
zh_tw: 未知 SSH 主機金鑰

# TrustHostKeyButton
source: Trust and connect
es_mx: Confía y conecta
id_id: Percaya dan terhubung
pt_pt: Confie e ligue-se
ru_ru: Доверять и подключиться
zh_cn: 信任并联系
zh_tw: 信任並聯繫

# HostKeyChangedTitle
source: SSH host key changed — connection blocked
es_mx: Se cambió la clave de host SSH: conexión bloqueada
id_id: Kunci host SSH berubah — koneksi diblokir
pt_pt: Chave de host SSH alterada – ligação bloqueada
ru_ru: Ключ SSH-сервера изменился — подключение заблокировано
zh_cn: SSH 主机密钥已更改 — 连接被阻止
zh_tw: SSH 主機金鑰已變更 — 連線被阻止

# ForgetHostKeyButton
source: Forget saved host key
es_mx: Olvidar la clave de host guardada
id_id: Lupakan kunci host yang disimpan
pt_pt: Esquecer a chave do host guardada
ru_ru: Забыть сохранённый ключ
zh_cn: 忘记保存的主机密钥
zh_tw: 忘記已儲存的主機密鑰

# HostKeyRemovedTitle
source: Saved host key removed
es_mx: Se eliminó la clave de host guardada
id_id: Kunci host yang disimpan dihapus
pt_pt: Chave de host guardada removida
ru_ru: Сохранённый ключ удалён
zh_cn: 已删除保存的主机密钥
zh_tw: 已刪除已儲存的主機密鑰

# HostKeyRemoveFailedTitle
source: Could not remove saved host key
es_mx: No se pudo eliminar la clave de host guardada
id_id: Tidak dapat menghapus kunci host yang disimpan
pt_pt: Não foi possível remover a chave do host guardada
ru_ru: Не удалось удалить сохранённый ключ
zh_cn: 无法删除已保存的主机密钥
zh_tw: 無法刪除已儲存的主機金鑰

# ConnectionDataErrorTitle
source: Saved connection data error
es_mx: Error de datos de conexión guardados
id_id: Kesalahan data koneksi yang disimpan
pt_pt: Erro de dados de ligação guardados
ru_ru: Ошибка данных сохранённого подключения
zh_cn: 保存的连接数据错误
zh_tw: 儲存的連接資料錯誤

# SavedConnectionsUnavailableTitle
source: Saved connections are unavailable
es_mx: Las conexiones guardadas no están disponibles
id_id: Koneksi tersimpan tidak tersedia
pt_pt: As ligações guardadas não estão disponíveis
ru_ru: Сохранённые подключения недоступны
zh_cn: 保存的连接不可用
zh_tw: 保存的連線不可用

# SavedConnectionsErrorTitle
source: Saved connections error
es_mx: Error de conexiones guardadas
id_id: Kesalahan koneksi tersimpan
pt_pt: Erro de ligações guardadas
ru_ru: Ошибка сохранённых подключений
zh_cn: 保存的连接错误
zh_tw: 儲存的連線錯誤

# SavedConnectionsUnavailableSubtitle
source: Saved connections are unavailable
es_mx: Las conexiones guardadas no están disponibles
id_id: Koneksi tersimpan tidak tersedia
pt_pt: As ligações guardadas não estão disponíveis
ru_ru: Сохранённые подключения недоступны
zh_cn: 保存的连接不可用
zh_tw: 保存的連線不可用

# HostKeyFirstUseMessage
source: This is the first connection to {0}:{1}. Verify this fingerprint with the server administrator before trusting it. {2} {3}
es_mx: Esta es la primera conexión con {0}:{1}. Verifique esta huella digital con el administrador del servidor antes de confiar en él. {2} {3}
id_id: Ini adalah koneksi pertama ke {0}:{1}. Verifikasi sidik jari ini dengan administrator server sebelum mempercayainya. {2} {3}
pt_pt: Esta é a primeira ligação com {0}:{1}. Verifique esta impressão digital com o administrador do servidor antes de confiar nela. {2} {3}
ru_ru: Это первое подключение к {0}:{1}. Перед подтверждением сверьте отпечаток с администратором сервера. {2} {3}
zh_cn: 这是与 {0}:{1} 的第一个连接。在信任该指纹之前，请先与服务器管理员验证该指纹。 {2} {3}
zh_tw: 這是首次連線到 {0}:{1}。請先與伺服器管理員核對此指紋，再決定是否信任。 {2} {3}

# HostKeyChangedFollowUpMessage
source: Forgetting the saved key will not connect to or trust the replacement key. After independently verifying it, start a new connection attempt.
es_mx: Si olvida la clave guardada, no se conectará ni confiará en la clave de reemplazo. Después de verificarlo de forma independiente, inicie un nuevo intento de conexión.
id_id: Melupakan kunci yang tersimpan tidak akan menghubungkan ke server atau memercayai kunci pengganti. Setelah memverifikasi sidik jari baru secara mandiri, mulai upaya koneksi baru.
pt_pt: Esquecer a chave guardada não ligará ou confiará na chave substituta. Após verificar de forma independente, inicie uma nova tentativa de ligação.
ru_ru: Удаление сохранённого ключа не подключит сервер и не даст доверие новому ключу. Независимо проверьте новый отпечаток и начните подключение заново.
zh_cn: 忘记保存的密钥不会连接到服务器，也不会信任新的密钥。请独立核验新指纹后重新发起连接。
zh_tw: 忘記已儲存的主機金鑰不會連線到伺服器，也不會信任新的金鑰。請獨立驗證新指紋後重新發起連線。

# HostKeyChangedDetailsMessage
source: SECURITY WARNING: the SSH host key for {0}:{1} has changed. The connection was blocked because this can indicate a server replacement or a man-in-the-middle attack. Expected: {2} SHA256:{3} Received: {4} SHA256:{5}
es_mx: ADVERTENCIA DE SEGURIDAD: la clave de host SSH para {0}:{1} ha cambiado. La conexión se bloqueó porque esto puede indicar un reemplazo del servidor o un ataque de intermediario. Esperado: {2} SHA256:{3} Recibido: {4} SHA256:{5}
id_id: PERINGATAN KEAMANAN: kunci host SSH untuk {0}:{1} telah berubah. Sambungan diblokir karena hal ini dapat mengindikasikan penggantian server atau serangan man-in-the-middle. Diharapkan: {2} SHA256:{3} Diterima: {4} SHA256:{5}
pt_pt: AVISO DE SEGURANÇA: a chave do host SSH para {0}:{1} foi alterada. A ligação foi bloqueada porque isso pode indicar uma substituição de servidor ou um ataque man-in-the-middle. Esperado: {2} SHA256:{3} Recebido: {4} SHA256:{5}
ru_ru: ВНИМАНИЕ: ключ SSH-сервера {0}:{1} изменился. Подключение заблокировано: это может означать замену сервера или атаку посредника. Ожидался: {2} SHA256:{3} Получен: {4} SHA256:{5}
zh_cn: 安全警告：{0}:{1} 的 SSH 主机密钥已更改。连接被阻止，因为这可能表明服务器更换或中间人攻击。 预期：{2} SHA256：{3} 收到：{4} SHA256：{5}
zh_tw: 安全性警告：{0}:{1} 的 SSH 主機金鑰已變更。連接被阻止，因為這可能表示伺服器更換或中間人攻擊。 預期：{2} SHA256：{3} 收到：{4} SHA256：{5}

# HostKeyForgottenMessage
source: No connection was made. Verify the new fingerprint, then connect again to explicitly trust it.
es_mx: No se realizó ninguna conexión. Verifique la nueva huella digital y luego conéctese nuevamente para confiar explícitamente en ella.
id_id: Tidak ada koneksi yang dibuat. Verifikasi sidik jari baru, lalu sambungkan lagi untuk memercayainya secara eksplisit.
pt_pt: Nenhuma ligação foi feita. Verifique a nova impressão digital e volte a ligar-se para confiar explicitamente nela.
ru_ru: Подключение не выполнялось. Проверьте новый отпечаток и подключитесь снова, чтобы явно подтвердить доверие.
zh_cn: 没有建立任何连接。验证新指纹，然后再次连接以明确信任它。
zh_tw: 沒有建立任何連線。驗證新指紋，然後再次連接以明確信任它。

# SavedConnectionsLoadErrorMessage
source: Saved connections could not be loaded. The existing files were left unchanged.
es_mx: No se pudieron cargar las conexiones guardadas. Los archivos existentes no se modificaron.
id_id: Koneksi yang disimpan tidak dapat dimuat. File-file yang ada dibiarkan tidak berubah.
pt_pt: Não foi possível carregar as ligações guardadas. Os ficheiros existentes foram deixados inalterados.
ru_ru: Не удалось загрузить сохранённые подключения. Существующие файлы не изменялись.
zh_cn: 无法加载已保存的连接。现有文件保持不变。
zh_tw: 無法載入已儲存的連線。現有文件保持不變。

# GroupStateSaveErrorMessage
source: The group state could not be saved.
es_mx: No se pudo guardar el estado del grupo.
id_id: Status grup tidak dapat disimpan.
pt_pt: O estado do grupo não pôde ser guardado.
ru_ru: Не удалось сохранить состояние группы.
zh_cn: 无法保存组状态。
zh_tw: 無法保存群組狀態。

# ConnectionSaveErrorMessage
source: The connection could not be saved. Its previous data was preserved.
es_mx: No se pudo guardar la conexión. Se conservaron sus datos anteriores.
id_id: Sambungan tidak dapat disimpan. Data sebelumnya dipertahankan.
pt_pt: A ligação não pôde ser guardada. Os seus dados anteriores foram preservados.
ru_ru: Не удалось сохранить подключение. Предыдущие данные сохранены.
zh_cn: 无法保存连接。其先前的数据被保留。
zh_tw: 無法保存連線。其先前的資料被保留。

# ConnectionDeleteErrorMessage
source: The connection could not be deleted. Its profile and credential were preserved when possible.
es_mx: No se pudo eliminar la conexión. Su perfil y credencial se conservaron cuando fue posible.
id_id: Sambungan tidak dapat dihapus. Profil dan kredensialnya dipertahankan bila memungkinkan.
pt_pt: A ligação não pôde ser excluída. O seu perfil e credencial foram preservados quando possível.
ru_ru: Не удалось удалить подключение. Профиль и учётные данные по возможности сохранены.
zh_cn: 无法删除连接。如果可能的话，它的配置文件和凭证都会被保留。
zh_tw: 無法刪除連線。如果可能的話，它的設定檔和憑證都會被保留。

# ConnectionTestTimedOut
source: The connection test timed out after 30 seconds.
es_mx: La prueba de conexión expiró después de 30 segundos.
id_id: Tes koneksi habis waktu setelah 30 detik.
pt_pt: O teste de ligação expirou após 30 segundos.
ru_ru: Проверка подключения не завершилась за 30 секунд.
zh_cn: 连接测试在 30 秒后超时。
zh_tw: 連線測試在 30 秒後逾時。

# AuthenticationModeBox.Header
source: Authentication
es_mx: Autenticación
id_id: Otentikasi
pt_pt: Autenticação
ru_ru: Способ входа
zh_cn: 认证
zh_tw: 認證

# PasswordAuthenticationItem.Content
source: Password
es_mx: Contraseña
id_id: Kata sandi
pt_pt: Senha
ru_ru: Пароль
zh_cn: 密码
zh_tw: 密碼

# PrivateKeyAuthenticationItem.Content
source: Private key
es_mx: clave privada
id_id: Kunci pribadi
pt_pt: Chave privada
ru_ru: Приватный ключ
zh_cn: 私钥
zh_tw: 私鑰

# PrivateKeyHelpText.Text
source: Select an OpenSSH, PEM, or supported private key file. The key file is not copied or stored by SFTP Explorer.
es_mx: Seleccione un archivo de clave privada OpenSSH, PEM o compatible. SFTP Explorer no copia ni almacena el archivo de clave.
id_id: Pilih file kunci pribadi OpenSSH, PEM, atau yang didukung. File kunci tidak disalin atau disimpan oleh SFTP Explorer.
pt_pt: Selecione um ficheiro de chave privada OpenSSH, PEM ou compatível. O ficheiro de chaves não é copiado ou armazenado pelo SFTP Explorer.
ru_ru: Выберите приватный ключ OpenSSH, PEM или другого поддерживаемого формата. SFTP Explorer не копирует и не сохраняет файл ключа.
zh_cn: 选择 OpenSSH、PEM 或支持的私钥文件。 SFTP Explorer 不会复制或存储密钥文件。
zh_tw: 選擇 OpenSSH、PEM 或支援的私鑰檔案。 SFTP Explorer 不會複製或儲存金鑰檔案。
